-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: disaster_db
-- ------------------------------------------------------
-- Server version	8.0.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `exceptioncp`
--

DROP TABLE IF EXISTS `exceptioncp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `exceptioncp` (
  `id` int NOT NULL AUTO_INCREMENT,
  `ExcludedCp` varchar(255) DEFAULT NULL,
  `TopCp` text,
  `where` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_excludedcp_location` (`ExcludedCp`),
  CONSTRAINT `fk_excludedcp_location` FOREIGN KEY (`ExcludedCp`) REFERENCES `locations` (`location_name`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=130 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `exceptioncp`
--

LOCK TABLES `exceptioncp` WRITE;
/*!40000 ALTER TABLE `exceptioncp` DISABLE KEYS */;
INSERT INTO `exceptioncp` VALUES (1,'서울경찰청','시도자치경찰위원회','서울'),(2,'부산경찰청','시도자치경찰위원회','서울'),(3,'대구경찰청','시도자치경찰위원회','서울'),(4,'인천경찰청','시도자치경찰위원회','서울'),(5,'광주경찰청','시도자치경찰위원회','서울'),(6,'대전경찰청','시도자치경찰위원회','서울'),(7,'울산경찰청','시도자치경찰위원회','서울'),(8,'경기남부경찰청','시도자치경찰위원회','서울'),(9,'경기북부경찰청','시도자치경찰위원회','서울'),(10,'강원경찰청','시도자치경찰위원회','서울'),(11,'충북경찰청','시도자치경찰위원회','서울'),(12,'충남경찰청','시도자치경찰위원회','서울'),(13,'세종경찰청','시도자치경찰위원회','울신'),(14,'전북경찰청','시도자치경찰위원회','부산'),(15,'전남경찰청','시도자치경찰위원회','서울'),(16,'경북경찰청','시도자치경찰위원회','서울'),(17,'경남경찰청','시도자치경찰위원회','대구'),(18,'제주경찰청','시도자치경찰위원회','부산'),(19,'한국수자원공사','환경부','대구'),(20,'강원특별자치도','광역자치단체','서울'),(21,'한국공항공사','국토교통부','대전'),(22,'한국토지주택공사','국토교통부','인천'),(23,'한국도로공사서비스','국토교통부','강원'),(24,'한국철도공사','국토교통부','원주'),(25,'코레일관광개발','국토교통부','전주'),(26,'코레일네트웍스','국토교통부','인천'),(27,'코레일로지스','국토교통부','대구'),(28,'코레일유통','국토교통부','부산'),(29,'인천국제공항공사','국토교통부','서울'),(30,'한국교통안전공단','국토교통부','서울'),(31,'한국국토정보공사','국토교통부','서울'),(32,'국토안전관리원','국토교통부','서울'),(33,'국가철도공단','국토교통부','서울'),(34,'항공안전기술원','국토교통부','서울'),(35,'건설기술교육원','국토교통부','서울'),(36,'한국가스기술공사','산업통상자원부','서울'),(37,'해양환경공단','산업통상자원부','서울'),(38,'한국승강기안전공단','산업통상자원부','서울'),(39,'한국전력거래소','산업통상자원부','부산'),(40,'한국전기안전공사','산업통상자원부','대구'),(41,'한국원자력환경공단','산업통상자원부','서울'),(42,'한국에너지공단','산업통상자원부','울산'),(43,'한국석유관리원','산업통상자원부','대구'),(44,'한국산업단지공단','산업통상자원부','대전'),(45,'국립공원공단','환경부','서울'),(46,'국립생태원','환경부','대구'),(47,'한국환경공단','환경부','인천'),(48,'한국해양교통안전공단','해양수산부','서울'),(49,'한국산림복지진흥원','산림청','부산'),(50,'한국수목원정원관리원','산림청','대구'),(51,'가축위생방역지원본부','농림축산식품부','서울'),(52,'국제식물검역인증원','농림축산식품부','대구'),(53,'농림수산식품교육문화정보원','농림축산식품부','대전'),(54,'농림식품기술기획평가원','농림축산식품부','인천'),(55,'축산환경관리원','농림축산식품부','강원'),(56,'대한석탄공사','산업통상자원부','원주'),(57,'전략물자관리원','산업통상자원부','서울'),(58,'한국에너지재단','산업통상자원부','대구'),(59,'한전원자력연료','산업통상자원부','대전'),(60,'한전MCS','산업통상자원부','서울'),(61,'한국탄소산업진흥원','산업통상자원부','부산'),(62,'국가생명윤리정책원','보건복지부','울산'),(63,'국립암센터','보건복지부','서울'),(64,'대한적심자사','보건복지부','울산'),(65,'한국보건의료정보원','보건복지부','부산'),(66,'한국보육진흥원','보건복지부','서울'),(67,'한국사회복지협의회','보건복지부','대구'),(68,'한국환경보전원','환경부','대전'),(69,'수도권매립지관리공사','환경부','서울'),(70,'자동차손해배상진흥원','국토교통부','대구'),(71,'한국원자력안전기술원','환경부','서울'),(72,'식품안전정보원','의약품안전처','대구'),(73,'국방과학연구소','국방과학연구소','대전'),(74,'국방기술품질원','국방과학연구소','대구'),(75,'한국소방산업기술원','소방청','서울'),(76,'한국소방안전원','소방청','울산'),(77,'대한소방송제회','소방청','대구'),(78,'서울소방재난본부','소방청','대전'),(79,'부산소방재난본부','소방청','서울'),(80,'대구소방안전본부','소방청','대구'),(81,'인천소방본부','소방청','대전'),(82,'광주소방안전본부','소방청','서울'),(83,'대전소방본부','소방청','부산'),(84,'울산소방본부','소방청','대구'),(85,'세종소방본부','소방청','서울'),(86,'경기소방재난본부','소방청','부산'),(87,'경기북부소방재난본부','소방청','대구'),(88,'강원소방본부','소방청','서울'),(89,'충북소방본부','소방청','부산'),(90,'충남소방본부','소방청','대구'),(91,'전북소방본부','소방청','서울'),(92,'전남소방본부','소방청','부산'),(93,'경북소방본부','소방청','대구'),(94,'경남소방본부','소방청','서울'),(95,'창원소방본부','소방청','부산'),(96,'제주소방안전본부','소방청','대전'),(97,'한국소방시설협회','소방청','울산'),(98,'제주자치경찰단','경찰청','대전'),(99,'한국도로교통공단','경찰청','서울'),(100,'사이버수사대','경찰청','대구'),(101,'서울교통공사','국토교통부','서울'),(102,'행정안전부','경찰청','울산'),(129,'한국도로공사','국토교통부','서울');
/*!40000 ALTER TABLE `exceptioncp` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-05 17:22:33
